# 第一题
"""
1 - 加载数据
读取当前目录下
东京奥运会奖牌数据.csv -> df1
东京奥运会奖牌分日数据.csv -> df2
"""


# 第二题
"""
2- 修改列名
将原 df1 列名 Unnamed: 2、Unnamed: 3、Unnamed: 4 修改为 金牌数、银牌数、铜牌数
"""


# 第三题
"""
3 - 数据类型查看
查看 df2 的数据类型
"""


# 第四题
"""
4 - 类型修改
将 df2 的获奖时间修改为 时间格式
"""


# 第五题
"""
5 - 数据排序
将 df2 按照获奖时间升序排列
"""


# 第六题
"""
6 - 匹配修改
给 df2 新增一列国家，总奖牌数，值根据 国家id 与 df1 匹配
注意：原始数据可能有一点问题，射击队杨倩应该是东京首金
"""


# 第七题
"""
7 - 分组统计
通过对 df2 的国家进行分组统计，计算每个国家的奖牌总数（也就是出现次数）
并查看奖牌数前5名，结果可以用 df1 进行验证
"""


# 第八题
"""
通过 df2 计算获得奖牌最多的运动员
注意：仅统计单人项目
"""


# 第九题
"""
9 - 数据查看
查看乒乓球项目的全部信息
"""


# 第十题
"""
10 - 数据透视
查看各国在不同项目上的获奖牌情况
"""


# 第十一题
"""
11 - 数据查询
在上一题的基础上，查询中国队的获奖牌详情
"""


# 第十二题
"""
12 - 个性化查看
在数据框中根据奖牌数量进行可视化
"""

# 第十三题
"""
13 - 数据格式化
将 df2 的获奖时间格式化为 x月x日
"""


# 第十四题
"""
14 - 分组统计
查看每天产生奖牌的数量
"""


# 第十五题
"""
15 - 数据透视
查看不同项目在不同国家的分布情况
"""


# 第十六题
"""
16 - 数据计算
计算中国每日总奖牌数量
"""


# 第十七题
"""
计算前十名各国每日奖牌数量合计
注意：对于第一天没有数据的国家用0填充，其余时间的缺失值用上一日数据填充
"""


# 第十八题
"""
18 - 条形图
对金牌数量排行前10的国家制作条形图
"""


# 第十九题
"""
19 - 堆叠图
将排行榜前十名的奖牌绘制堆叠图
"""


# 第二十题
"""
20 - 饼图
绘制中国队的奖牌分布饼图
"""


# 第二十一题
"""
21 - 地图
绘制各国奖牌分布热力地图
"""


# 第二十二题
"""
22 - 动态图
将排行榜前十名的奖牌变化动态展示
"""